# Задача 2. Задайте последовательность чисел. Напишите программу, которая выведет список 
# неповторяющихся элементов исходной последовательности. Не использовать множества.
# Постарайтесь решить за одно условие
# Пример: [1,1,1,1,2,2,2,3,3,3,4] -> [1,2,3,4]

numbers = [1,1,1,1,2,2,2,3,3,3,4]
print(numbers)
print(set(numbers))